#include "wan.h"
#include "elmo.h"
/*======================================================================================
函数定义	：		直线闭环
函数参数	：		直线上一点x，y坐标，直线角度，速度(mm)
函数返回值  ：		无
(fabs 为取float型变量的绝对值)  PID的值需调节
=======================================================================================*/
extern int g_camera;
void SeekBall(void)
{
	
	//检测左方有球,右轮CAN1加速,左轮CAN2减速
	if(g_camera==1)
	{
	  VelCrl(CAN1, 1, 1000);
	  VelCrl(CAN1, 2, 1000);
	}
	
	//检测右方有球,左轮CAN2加速,右轮CAN1减速
	if(g_camera==3)
	{
	  VelCrl(CAN1, 1, 1000);
	  VelCrl(CAN1, 2, 1000);	
	}
}

