/*=====================================================结构体定义===================================================*/
//记录左中右小球个数
typedef struct
{
	int leftNum;
	int midNum;
	int rightNum;
}BALLNUM_T;
/*=====================================================宏定义区域==================================================*/
#define CAMERATOGYRO 32
#define ANGTORAD(x) ((x)*PI/180)
#define RADTOANG(x) ((x)*180/PI)
/*=====================================================函数定义===================================================*/
float AvoidOverAngle(float angle); //避免角度溢出
BALLNUM_T SeekMaxBall(void);       //寻找最多小球的区域

